FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_R4F_TI_RM46_HERCULES_GCC/BoardFiles/include/hw_emac.h
/*
 * hw_emac1.h
 */

/*
 * Copyright (C) 2009-2018 Texas Instruments Incorporated - www.ti.com
 *
 *
 *  Redistribution and use in source and binary forms, with or without
 *  modification, are permitted provided that the following conditions
 *  are met:
 *
 *    Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 *    Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the
 *    distribution.
 *
 *    Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 *  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 *  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 *  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
 *  A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT
 *  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
 *  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
 *  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
 *  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
 *  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 *  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
 *  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 */

#ifndef _HW_EMAC_H_
#define _HW_EMAC_H_

/* USER CODE BEGIN (0) */
/* USER CODE END */

#ifdef __cplusplus
extern "C" {
#endif

/* USER CODE BEGIN (1) */
/* USER CODE END */

#define EMAC_BASE                                   ( 0xFCF78000U )
#define EMAC_CTRL_BASE                              ( 0xFCF78800U )
#define EMAC_CTRL_RAM_BASE                          ( 0xFC520000U )

#define EMAC_TXREVID                                ( 0x0U )
#define EMAC_TXCONTROL                              ( 0x4U )
#define EMAC_TXTEARDOWN                             ( 0x8U )
#define EMAC_RXREVID                                ( 0x10U )
#define EMAC_RXCONTROL                              ( 0x14U )
#define EMAC_RXTEARDOWN                             ( 0x18U )
#define EMAC_TXINTSTATRAW                           ( 0x80U )
#define EMAC_TXINTSTATMASKED                        ( 0x84U )
#define EMAC_TXINTMASKSET                           ( 0x88U )
#define EMAC_TXINTMASKCLEAR                         ( 0x8CU )
#define EMAC_MACINVECTOR                            ( 0x90U )
#define EMAC_MACEOIVECTOR                           ( 0x94U )
#define EMAC_RXINTSTATRAW                           ( 0xA0U )
#define EMAC_RXINTSTATMASKED                        ( 0xA4U )
#define EMAC_RXINTMASKSET                           ( 0xA8U )
#define EMAC_RXINTMASKCLEAR                         ( 0xACU )
#define EMAC_MACINTSTATRAW                          ( 0xB0U )
#define EMAC_MACINTSTATMASKED                       ( 0xB4U )
#define EMAC_MACINTMASKSET                          ( 0xB8U )
#define EMAC_MACINTMASKCLEAR                        ( 0xBCU )
#define EMAC_RXMBPENABLE                            ( 0x100U )
#define EMAC_RXUNICASTSET                           ( 0x104U )
#define EMAC_RXUNICASTCLEAR                         ( 0x108U )
#define EMAC_RXMAXLEN                               ( 0x10CU )
#define EMAC_RXBUFFEROFFSET                         ( 0x110U )
#define EMAC_RXFILTERLOWTHRESH                      ( 0x114U )
#define EMAC_RXFLOWTHRESH( n )                      ( ( uint32 ) 0x120U + ( uint32 ) ( ( n ) * 4U ) )
#define EMAC_RXFREEBUFFER( n )                      ( ( uint32 ) 0x140U + ( uint32 ) ( ( n ) * 4U ) )
#define EMAC_MACCONTROL                             ( 0x160U )
#define EMAC_MACSTATUS                              ( 0x164U )
#define EMAC_EMCONTROL                              ( 0x168U )
#define EMAC_FIFOCONTROL                            ( 0x16CU )
#define EMAC_MACCONFIG                              ( 0x170U )
#define EMAC_SOFTRESET                              ( 0x174U )
#define EMAC_MACSRCADDRLO                           ( 0x1D0U )
#define EMAC_MACSRCADDRHI                           ( 0x1D4U )
#define EMAC_MACHASH1                               ( 0x1D8U )
#define EMAC_MACHASH2                               ( 0x1DCU )
#define EMAC_BOFFTEST                               ( 0x1E0U )
#define EMAC_TPACETEST                              ( 0x1E4U )
#define EMAC_RXPAUSE                                ( 0x1E8U )
#define EMAC_TXPAUSE                                ( 0x1ECU )
#define EMAC_RXGOODFRAMES                           ( 0x200U )
#define EMAC_RXBCASTFRAMES                          ( 0x204U )
#define EMAC_RXMCASTFRAMES                          ( 0x208U )
#define EMAC_RXPAUSEFRAMES                          ( 0x20CU )
#define EMAC_RXCRCERRORS                            ( 0x210U )
#define EMAC_RXALIGNCODEERRORS                      ( 0x214U )
#define EMAC_RXOVERSIZED                            ( 0x218U )
#define EMAC_RXJABBER                               ( 0x21CU )
#define EMAC_RXUNDERSIZED                           ( 0x220U )
#define EMAC_RXFRAGMENTS                            ( 0x224U )
#define EMAC_RXFILTERED                             ( 0x228U )
#define EMAC_RXQOSFILTERED                          ( 0x22CU )
#define EMAC_RXOCTETS                               ( 0x230U )
#define EMAC_TXGOODFRAMES                           ( 0x234U )
#define EMAC_TXBCASTFRAMES                          ( 0x238U )
#define EMAC_TXMCASTFRAMES                          ( 0x23CU )
#define EMAC_TXPAUSEFRAMES                          ( 0x240U )
#define EMAC_TXDEFERRED                             ( 0x244U )
#define EMAC_TXCOLLISION                            ( 0x248U )
#define EMAC_TXSINGLECOLL                           ( 0x24CU )
#define EMAC_TXMULTICOLL                            ( 0x250U )
#define EMAC_TXEXCESSIVECOLL                        ( 0x254U )
#define EMAC_TXLATECOLL                             ( 0x258U )
#define EMAC_TXUNDERRUN                             ( 0x25CU )
#define EMAC_TXCARRIERSENSE                         ( 0x260U )
#define EMAC_TXOCTETS                               ( 0x264U )
#define EMAC_FRAME64                                ( 0x268U )
#define EMAC_FRAME65T127                            ( 0x26CU )
#define EMAC_FRAME128T255                           ( 0x270U )
#define EMAC_FRAME256T511                           ( 0x274U )
#define EMAC_FRAME512T1023                          ( 0x278U )
#define EMAC_FRAME1024TUP                           ( 0x27CU )
#define EMAC_NETOCTETS                              ( 0x208U )
#define EMAC_RXSOFOVERRUNS                          ( 0x284U )
#define EMAC_RXMOFOVERRUNS                          ( 0x288U )
#define EMAC_RXDMAOVERRUNS                          ( 0x28CU )
#define EMAC_MACADDRLO                              ( 0x500U )
#define EMAC_MACADDRHI                              ( 0x504U )
#define EMAC_MACINDEX                               ( 0x508U )
#define EMAC_TXHDP( n )                             ( ( uint32 ) 0x600U + ( uint32 ) ( ( n ) * 4U ) )
#define EMAC_RXHDP( n )                             ( ( uint32 ) 0x620U + ( uint32 ) ( ( n ) * 4U ) )
#define EMAC_TXCP( n )                              ( ( uint32 ) 0x640U + ( uint32 ) ( ( n ) * 4U ) )
#define EMAC_RXCP( n )                              ( ( uint32 ) 0x660U + ( uint32 ) ( ( n ) * 4U ) )

