FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_R4F_TI_RM46_HERCULES_GCC/BoardFiles/include/hw_emac.h
/**************************************************************************\
* Field Definition Macros
\**************************************************************************/

/* TXREVID */

#define EMAC_TXREVID_TXREV                          ( 0xFFFFFFFFU )
#define EMAC_TXREVID_TXREV_SHIFT                    ( 0x00000000U )

/* TXCONTROL */

#define EMAC_TXCONTROL_TXEN                         ( 0x00000001U )
#define EMAC_TXCONTROL_TXEN_SHIFT                   ( 0x00000000U )
#define EMAC_TXCONTROL_TXDIS                        ( 0x00000000U )

/* TXTEARDOWN */

#define EMAC_TXTEARDOWN_TXTDNCH                     ( 0x00000007U )
#define EMAC_TXTEARDOWN_TXTDNCH_SHIFT               ( 0x00000000U )
#define EMAC_TXTEARDOWN_TXTDNCH_CHA0                ( 0x00000000U )
#define EMAC_TXTEARDOWN_TXTDNCH_CHA1                ( 0x00000001U )
#define EMAC_TXTEARDOWN_TXTDNCH_CHA2                ( 0x00000002U )
#define EMAC_TXTEARDOWN_TXTDNCH_CHA3                ( 0x00000003U )
#define EMAC_TXTEARDOWN_TXTDNCH_CHA4                ( 0x00000004U )
#define EMAC_TXTEARDOWN_TXTDNCH_CHA5                ( 0x00000005U )
#define EMAC_TXTEARDOWN_TXTDNCH_CHA6                ( 0x00000006U )
#define EMAC_TXTEARDOWN_TXTDNCH_CHA7                ( 0x00000007U )

/* RXREVID */

#define EMAC_RXREVID_RXREV                          ( 0xFFFFFFFFU )
#define EMAC_RXREVID_RXREV_SHIFT                    ( 0x00000000U )

/* RXCONTROL */

#define EMAC_RXCONTROL_RXEN                         ( 0x00000001U )
#define EMAC_RXCONTROL_RXEN_SHIFT                   ( 0x00000000U )
#define EMAC_RXCONTROL_RXDIS                        ( 0x00000000U )

/* RXTEARDOWN */

#define EMAC_RXTEARDOWN_RXTDNCH                     ( 0x00000007U )
#define EMAC_RXTEARDOWN_RXTDNCH_SHIFT               ( 0x00000000U )
#define EMAC_RXTEARDOWN_RXTDNCH_CHA0                ( 0x00000000U )
#define EMAC_RXTEARDOWN_RXTDNCH_CHA1                ( 0x00000001U )
#define EMAC_RXTEARDOWN_RXTDNCH_CHA2                ( 0x00000002U )
#define EMAC_RXTEARDOWN_RXTDNCH_CHA3                ( 0x00000003U )
#define EMAC_RXTEARDOWN_RXTDNCH_CHA4                ( 0x00000004U )
#define EMAC_RXTEARDOWN_RXTDNCH_CHA5                ( 0x00000005U )
#define EMAC_RXTEARDOWN_RXTDNCH_CHA6                ( 0x00000006U )
#define EMAC_RXTEARDOWN_RXTDNCH_CHA7                ( 0x00000007U )

/* TXINTSTATRAW */

#define EMAC_TXINTSTATRAW_TX7PEND                   ( 0x00000080U )
#define EMAC_TXINTSTATRAW_TX7PEND_SHIFT             ( 0x00000007U )

#define EMAC_TXINTSTATRAW_TX6PEND                   ( 0x00000040U )
#define EMAC_TXINTSTATRAW_TX6PEND_SHIFT             ( 0x00000006U )

#define EMAC_TXINTSTATRAW_TX5PEND                   ( 0x00000020U )
#define EMAC_TXINTSTATRAW_TX5PEND_SHIFT             ( 0x00000005U )

#define EMAC_TXINTSTATRAW_TX4PEND                   ( 0x00000010U )
#define EMAC_TXINTSTATRAW_TX4PEND_SHIFT             ( 0x00000004U )

#define EMAC_TXINTSTATRAW_TX3PEND                   ( 0x00000008U )
#define EMAC_TXINTSTATRAW_TX3PEND_SHIFT             ( 0x00000003U )

#define EMAC_TXINTSTATRAW_TX2PEND                   ( 0x00000004U )
#define EMAC_TXINTSTATRAW_TX2PEND_SHIFT             ( 0x00000002U )

#define EMAC_TXINTSTATRAW_TX1PEND                   ( 0x00000002U )
#define EMAC_TXINTSTATRAW_TX1PEND_SHIFT             ( 0x00000001U )

#define EMAC_TXINTSTATRAW_TX0PEND                   ( 0x00000001U )
#define EMAC_TXINTSTATRAW_TX0PEND_SHIFT             ( 0x00000000U )

/* TXINTSTATMASKED */

#define EMAC_TXINTSTATMASKED_TX7PEND                ( 0x00000080U )
#define EMAC_TXINTSTATMASKED_TX7PEND_SHIFT          ( 0x00000007U )

#define EMAC_TXINTSTATMASKED_TX6PEND                ( 0x00000040U )
#define EMAC_TXINTSTATMASKED_TX6PEND_SHIFT          ( 0x00000006U )

#define EMAC_TXINTSTATMASKED_TX5PEND                ( 0x00000020U )
#define EMAC_TXINTSTATMASKED_TX5PEND_SHIFT          ( 0x00000005U )

#define EMAC_TXINTSTATMASKED_TX4PEND                ( 0x00000010U )
#define EMAC_TXINTSTATMASKED_TX4PEND_SHIFT          ( 0x00000004U )

#define EMAC_TXINTSTATMASKED_TX3PEND                ( 0x00000008U )
#define EMAC_TXINTSTATMASKED_TX3PEND_SHIFT          ( 0x00000003U )

#define EMAC_TXINTSTATMASKED_TX2PEND                ( 0x00000004U )
#define EMAC_TXINTSTATMASKED_TX2PEND_SHIFT          ( 0x00000002U )

#define EMAC_TXINTSTATMASKED_TX1PEND                ( 0x00000002U )
#define EMAC_TXINTSTATMASKED_TX1PEND_SHIFT          ( 0x00000001U )

#define EMAC_TXINTSTATMASKED_TX0PEND                ( 0x00000001U )
#define EMAC_TXINTSTATMASKED_TX0PEND_SHIFT          ( 0x00000000U )

/* TXINTMASKSET */

#define EMAC_TXINTMASKSET_TX7MASK                   ( 0x00000080U )
#define EMAC_TXINTMASKSET_TX7MASK_SHIFT             ( 0x00000007U )

#define EMAC_TXINTMASKSET_TX6MASK                   ( 0x00000040U )
#define EMAC_TXINTMASKSET_TX6MASK_SHIFT             ( 0x00000006U )

#define EMAC_TXINTMASKSET_TX5MASK                   ( 0x00000020U )
#define EMAC_TXINTMASKSET_TX5MASK_SHIFT             ( 0x00000005U )

#define EMAC_TXINTMASKSET_TX4MASK                   ( 0x00000010U )
#define EMAC_TXINTMASKSET_TX4MASK_SHIFT             ( 0x00000004U )

#define EMAC_TXINTMASKSET_TX3MASK                   ( 0x00000008U )
#define EMAC_TXINTMASKSET_TX3MASK_SHIFT             ( 0x00000003U )

#define EMAC_TXINTMASKSET_TX2MASK                   ( 0x00000004U )
#define EMAC_TXINTMASKSET_TX2MASK_SHIFT             ( 0x00000002U )

#define EMAC_TXINTMASKSET_TX1MASK                   ( 0x00000002U )
#define EMAC_TXINTMASKSET_TX1MASK_SHIFT             ( 0x00000001U )

#define EMAC_TXINTMASKSET_TX0MASK                   ( 0x00000001U )
#define EMAC_TXINTMASKSET_TX0MASK_SHIFT             ( 0x00000000U )

/* TXINTMASKCLEAR */

#define EMAC_TXINTMASKCLEAR_TX7MASK                 ( 0x00000080U )
#define EMAC_TXINTMASKCLEAR_TX7MASK_SHIFT           ( 0x00000007U )

#define EMAC_TXINTMASKCLEAR_TX6MASK                 ( 0x00000040U )
#define EMAC_TXINTMASKCLEAR_TX6MASK_SHIFT           ( 0x00000006U )

#define EMAC_TXINTMASKCLEAR_TX5MASK                 ( 0x00000020U )
#define EMAC_TXINTMASKCLEAR_TX5MASK_SHIFT           ( 0x00000005U )

#define EMAC_TXINTMASKCLEAR_TX4MASK                 ( 0x00000010U )
#define EMAC_TXINTMASKCLEAR_TX4MASK_SHIFT           ( 0x00000004U )

#define EMAC_TXINTMASKCLEAR_TX3MASK                 ( 0x00000008U )
#define EMAC_TXINTMASKCLEAR_TX3MASK_SHIFT           ( 0x00000003U )

