FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_R4F_TI_RM46_HERCULES_GCC/BoardFiles/include/hw_emac.h
#define EMAC_MACSTATUS_IDLE                         ( 0x80000000U )
#define EMAC_MACSTATUS_IDLE_SHIFT                   ( 0x0000001FU )
#define EMAC_MACSTATUS_TXERRCODE                    ( 0x00F00000U )
#define EMAC_MACSTATUS_TXERRCODE_SHIFT              ( 0x00000014U )
/*----TXERRCODE Tokens----*/
#define EMAC_MACSTATUS_TXERRCODE_NOERROR            ( 0x00000000U )
#define EMAC_MACSTATUS_TXERRCODE_SOPERROR           ( 0x00000001U )
#define EMAC_MACSTATUS_TXERRCODE_OWNERSHIP          ( 0x00000002U )
#define EMAC_MACSTATUS_TXERRCODE_NOEOP              ( 0x00000003U )
#define EMAC_MACSTATUS_TXERRCODE_NULLPTR            ( 0x00000004U )
#define EMAC_MACSTATUS_TXERRCODE_NULLEN             ( 0x00000005U )
#define EMAC_MACSTATUS_TXERRCODE_LENERROR           ( 0x00000006U )

#define EMAC_MACSTATUS_TXERRCH                      ( 0x00070000U )
#define EMAC_MACSTATUS_TXERRCH_SHIFT                ( 0x00000010U )
/*----TXERRCH Tokens----*/
#define EMAC_MACSTATUS_TXERRCH_CHA0                 ( 0x00000000U )
#define EMAC_MACSTATUS_TXERRCH_CHA1                 ( 0x00000001U )
#define EMAC_MACSTATUS_TXERRCH_CHA2                 ( 0x00000002U )
#define EMAC_MACSTATUS_TXERRCH_CHA3                 ( 0x00000003U )
#define EMAC_MACSTATUS_TXERRCH_CHA4                 ( 0x00000004U )
#define EMAC_MACSTATUS_TXERRCH_CHA5                 ( 0x00000005U )
#define EMAC_MACSTATUS_TXERRCH_CHA6                 ( 0x00000006U )
#define EMAC_MACSTATUS_TXERRCH_CHA7                 ( 0x00000007U )

#define EMAC_MACSTATUS_RXERRCODE                    ( 0x0000F000U )
#define EMAC_MACSTATUS_RXERRCODE_SHIFT              ( 0x0000000CU )
/*----RXERRCODE Tokens----*/
#define EMAC_MACSTATUS_RXERRCODE_NOERROR            ( 0x00000000U )
#define EMAC_MACSTATUS_RXERRCODE_OWNERSHIP          ( 0x00000002U )
#define EMAC_MACSTATUS_RXERRCODE_NULLPTR            ( 0x00000004U )

#define EMAC_MACSTATUS_RXERRCH                      ( 0x00000700U )
#define EMAC_MACSTATUS_RXERRCH_SHIFT                ( 0x00000008U )
/*----RXERRCH Tokens----*/
#define EMAC_MACSTATUS_RXERRCH_CHA0                 ( 0x00000000U )
#define EMAC_MACSTATUS_RXERRCH_CHA1                 ( 0x00000001U )
#define EMAC_MACSTATUS_RXERRCH_CHA2                 ( 0x00000002U )
#define EMAC_MACSTATUS_RXERRCH_CHA3                 ( 0x00000003U )
#define EMAC_MACSTATUS_RXERRCH_CHA4                 ( 0x00000004U )
#define EMAC_MACSTATUS_RXERRCH_CHA5                 ( 0x00000005U )
#define EMAC_MACSTATUS_RXERRCH_CHA6                 ( 0x00000006U )
#define EMAC_MACSTATUS_RXERRCH_CHA7                 ( 0x00000007U )

#define EMAC_MACSTATUS_RXQOSACT                     ( 0x00000004U )
#define EMAC_MACSTATUS_RXQOSACT_SHIFT               ( 0x00000002U )
#define EMAC_MACSTATUS_RXFLOWACT                    ( 0x00000002U )
#define EMAC_MACSTATUS_RXFLOWACT_SHIFT              ( 0x00000001U )
#define EMAC_MACSTATUS_TXFLOWACT                    ( 0x00000001U )
#define EMAC_MACSTATUS_TXFLOWACT_SHIFT              ( 0x00000000U )

/* EMCONTROL */

#define EMAC_EMCONTROL_SOFT                         ( 0x00000002U )
#define EMAC_EMCONTROL_SOFT_SHIFT                   ( 0x00000001U )

#define EMAC_EMCONTROL_FREE                         ( 0x00000001U )
#define EMAC_EMCONTROL_FREE_SHIFT                   ( 0x00000000U )

/* FIFOCONTROL */

#define EMAC_FIFOCONTROL_TXCELLTHRESH               ( 0x00000003U )
#define EMAC_FIFOCONTROL_TXCELLTHRESH_SHIFT         ( 0x00000000U )

/* MACCONFIG */

#define EMAC_MACCONFIG_TXCELLDEPTH                  ( 0xFF000000U )
#define EMAC_MACCONFIG_TXCELLDEPTH_SHIFT            ( 0x00000018U )

#define EMAC_MACCONFIG_RXCELLDEPTH                  ( 0x00FF0000U )
#define EMAC_MACCONFIG_RXCELLDEPTH_SHIFT            ( 0x00000010U )

#define EMAC_MACCONFIG_ADDRESSTYPE                  ( 0x0000FF00U )
#define EMAC_MACCONFIG_ADDRESSTYPE_SHIFT            ( 0x00000008U )

#define EMAC_MACCONFIG_MACCFIG                      ( 0x000000FFU )
#define EMAC_MACCONFIG_MACCFIG_SHIFT                ( 0x00000000U )

/* SOFTRESET */

#define EMAC_SOFTRESET_SOFTRESET                    ( 0x00000001U )
#define EMAC_SOFTRESET_SOFTRESET_SHIFT              ( 0x00000000U )

/* MACSRCADDRLO */

#define EMAC_MACSRCADDRLO_MACSRCADDR0               ( 0x0000FF00U )
#define EMAC_MACSRCADDRLO_MACSRCADDR0_SHIFT         ( 0x00000008U )
#define EMAC_MACSRCADDRLO_MACSRCADDR1               ( 0x000000FFU )
#define EMAC_MACSRCADDRLO_MACSRCADDR1_SHIFT         ( 0x00000000U )

/* MACSRCADDRHI */

#define EMAC_MACSRCADDRHI_MACSRCADDR2               ( 0xFF000000U )
#define EMAC_MACSRCADDRHI_MACSRCADDR2_SHIFT         ( 0x00000018U )

#define EMAC_MACSRCADDRHI_MACSRCADDR3               ( 0x00FF0000U )
#define EMAC_MACSRCADDRHI_MACSRCADDR3_SHIFT         ( 0x00000010U )

#define EMAC_MACSRCADDRHI_MACSRCADDR4               ( 0x0000FF00U )
#define EMAC_MACSRCADDRHI_MACSRCADDR4_SHIFT         ( 0x00000008U )

#define EMAC_MACSRCADDRHI_MACSRCADDR5               ( 0x000000FFU )
#define EMAC_MACSRCADDRHI_MACSRCADDR5_SHIFT         ( 0x00000000U )

/* MACHASH1 */

#define EMAC_MACHASH1_MACHASH1                      ( 0xFFFFFFFFU )
#define EMAC_MACHASH1_MACHASH1_SHIFT                ( 0x00000000U )

/* MACHASH2 */

#define EMAC_MACHASH2_MACHASH2                      ( 0xFFFFFFFFU )
#define EMAC_MACHASH2_MACHASH2_SHIFT                ( 0x00000000U )

/* BOFFTEST */

#define EMAC_BOFFTEST_RNDNUM                        ( 0x03FF0000U )
#define EMAC_BOFFTEST_RNDNUM_SHIFT                  ( 0x00000010U )

#define EMAC_BOFFTEST_COLLCOUNT                     ( 0x0000F000U )
#define EMAC_BOFFTEST_COLLCOUNT_SHIFT               ( 0x0000000CU )

#define EMAC_BOFFTEST_TXBACKOFF                     ( 0x000003FFU )
#define EMAC_BOFFTEST_TXBACKOFF_SHIFT               ( 0x00000000U )

/* TPACETEST */

#define EMAC_TPACETEST_PACEVAL                      ( 0x0000001FU )
#define EMAC_TPACETEST_PACEVAL_SHIFT                ( 0x00000000U )

/* RXPAUSE */

#define EMAC_RXPAUSE_PAUSETIMER                     ( 0x0000FFFFU )
#define EMAC_RXPAUSE_PAUSETIMER_SHIFT               ( 0x00000000U )

/* TXPAUSE */

#define EMAC_TXPAUSE_PAUSETIMER                     ( 0x0000FFFFU )
#define EMAC_TXPAUSE_PAUSETIMER_SHIFT               ( 0x00000000U )

/* RXGOODFRAMES */

#define EMAC_RXGOODFRAMES_COUNT                     ( 0xFFFFFFFFU )
#define EMAC_RXGOODFRAMES_COUNT_SHIFT               ( 0x00000000U )

/* RXBCASTFRAMES */

#define EMAC_RXBCASTFRAMES_COUNT                    ( 0xFFFFFFFFU )
#define EMAC_RXBCASTFRAMES_COUNT_SHIFT              ( 0x00000000U )

