FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_R4F_TI_RM46_HERCULES_GCC/BoardFiles/include/hw_emac.h
/* RXMCASTFRAMES */

#define EMAC_RXMCASTFRAMES_COUNT                    ( 0xFFFFFFFFU )
#define EMAC_RXMCASTFRAMES_COUNT_SHIFT              ( 0x00000000U )

/* RXPAUSEFRAMES */

#define EMAC_RXPAUSEFRAMES_COUNT                    ( 0xFFFFFFFFU )
#define EMAC_RXPAUSEFRAMES_COUNT_SHIFT              ( 0x00000000U )

/* RXCRCERRORS */

#define EMAC_RXCRCERRORS_COUNT                      ( 0xFFFFFFFFU )
#define EMAC_RXCRCERRORS_COUNT_SHIFT                ( 0x00000000U )

/* RXALIGNCODEERRORS */

#define EMAC_RXALIGNCODEERRORS_COUNT                ( 0xFFFFFFFFU )
#define EMAC_RXALIGNCODEERRORS_COUNT_SHIFT          ( 0x00000000U )

/* RXOVERSIZED */

#define EMAC_RXOVERSIZED_COUNT                      ( 0xFFFFFFFFU )
#define EMAC_RXOVERSIZED_COUNT_SHIFT                ( 0x00000000U )

/* RXJABBER */

#define EMAC_RXJABBER_COUNT                         ( 0xFFFFFFFFU )
#define EMAC_RXJABBER_COUNT_SHIFT                   ( 0x00000000U )

/* RXUNDERSIZED */

#define EMAC_RXUNDERSIZED_COUNT                     ( 0xFFFFFFFFU )
#define EMAC_RXUNDERSIZED_COUNT_SHIFT               ( 0x00000000U )

/* RXFRAGMENTS */

#define EMAC_RXFRAGMENTS_COUNT                      ( 0xFFFFFFFFU )
#define EMAC_RXFRAGMENTS_COUNT_SHIFT                ( 0x00000000U )

/* RXFILTERED */

#define EMAC_RXFILTERED_COUNT                       ( 0xFFFFFFFFU )
#define EMAC_RXFILTERED_COUNT_SHIFT                 ( 0x00000000U )

/* RXQOSFILTERED */

#define EMAC_RXQOSFILTERED_COUNT                    ( 0xFFFFFFFFU )
#define EMAC_RXQOSFILTERED_COUNT_SHIFT              ( 0x00000000U )

/* RXOCTETS */

#define EMAC_RXOCTETS_COUNT                         ( 0xFFFFFFFFU )
#define EMAC_RXOCTETS_COUNT_SHIFT                   ( 0x00000000U )

/* TXGOODFRAMES */

#define EMAC_TXGOODFRAMES_COUNT                     ( 0xFFFFFFFFU )
#define EMAC_TXGOODFRAMES_COUNT_SHIFT               ( 0x00000000U )

/* TXBCASTFRAMES */

#define EMAC_TXBCASTFRAMES_COUNT                    ( 0xFFFFFFFFU )
#define EMAC_TXBCASTFRAMES_COUNT_SHIFT              ( 0x00000000U )

/* TXMCASTFRAMES */

#define EMAC_TXMCASTFRAMES_COUNT                    ( 0xFFFFFFFFU )
#define EMAC_TXMCASTFRAMES_COUNT_SHIFT              ( 0x00000000U )

/* TXPAUSEFRAMES */

#define EMAC_TXPAUSEFRAMES_COUNT                    ( 0xFFFFFFFFU )
#define EMAC_TXPAUSEFRAMES_COUNT_SHIFT              ( 0x00000000U )

/* TXDEFERRED */

#define EMAC_TXDEFERRED_COUNT                       ( 0xFFFFFFFFU )
#define EMAC_TXDEFERRED_COUNT_SHIFT                 ( 0x00000000U )

/* TXCOLLISION */

#define EMAC_TXCOLLISION_COUNT                      ( 0xFFFFFFFFU )
#define EMAC_TXCOLLISION_COUNT_SHIFT                ( 0x00000000U )

/* TXSINGLECOLL */

#define EMAC_TXSINGLECOLL_COUNT                     ( 0xFFFFFFFFU )
#define EMAC_TXSINGLECOLL_COUNT_SHIFT               ( 0x00000000U )

/* TXMULTICOLL */

#define EMAC_TXMULTICOLL_COUNT                      ( 0xFFFFFFFFU )
#define EMAC_TXMULTICOLL_COUNT_SHIFT                ( 0x00000000U )

/* TXEXCESSIVECOLL */

#define EMAC_TXEXCESSIVECOLL_COUNT                  ( 0xFFFFFFFFU )
#define EMAC_TXEXCESSIVECOLL_COUNT_SHIFT            ( 0x00000000U )

/* TXLATECOLL */

#define EMAC_TXLATECOLL_COUNT                       ( 0xFFFFFFFFU )
#define EMAC_TXLATECOLL_COUNT_SHIFT                 ( 0x00000000U )

/* TXUNDERRUN */

#define EMAC_TXUNDERRUN_COUNT                       ( 0xFFFFFFFFU )
#define EMAC_TXUNDERRUN_COUNT_SHIFT                 ( 0x00000000U )

/* TXCARRIERSENSE */

#define EMAC_TXCARRIERSENSE_COUNT                   ( 0xFFFFFFFFU )
#define EMAC_TXCARRIERSENSE_COUNT_SHIFT             ( 0x00000000U )

/* TXOCTETS */

#define EMAC_TXOCTETS_COUNT                         ( 0xFFFFFFFFU )
#define EMAC_TXOCTETS_COUNT_SHIFT                   ( 0x00000000U )

/* FRAME64 */

#define EMAC_FRAME64_COUNT                          ( 0xFFFFFFFFU )
#define EMAC_FRAME64_COUNT_SHIFT                    ( 0x00000000U )

/* FRAME65T127 */

#define EMAC_FRAME65T127_COUNT                      ( 0xFFFFFFFFU )
#define EMAC_FRAME65T127_COUNT_SHIFT                ( 0x00000000U )

/* FRAME128T255 */

#define EMAC_FRAME128T255_COUNT                     ( 0xFFFFFFFFU )
#define EMAC_FRAME128T255_COUNT_SHIFT               ( 0x00000000U )

/* FRAME256T511 */

#define EMAC_FRAME256T511_COUNT                     ( 0xFFFFFFFFU )
#define EMAC_FRAME256T511_COUNT_SHIFT               ( 0x00000000U )

/* FRAME512T1023 */

#define EMAC_FRAME512T1023_COUNT                    ( 0xFFFFFFFFU )
#define EMAC_FRAME512T1023_COUNT_SHIFT              ( 0x00000000U )

/* FRAME1024TUP */

#define EMAC_FRAME1024TUP_COUNT                     ( 0xFFFFFFFFU )
#define EMAC_FRAME1024TUP_COUNT_SHIFT               ( 0x00000000U )

/* NETOCTETS */

#define EMAC_NETOCTETS_COUNT                        ( 0xFFFFFFFFU )
#define EMAC_NETOCTETS_COUNT_SHIFT                  ( 0x00000000U )

/* RXSOFOVERRUNS */

#define EMAC_RXSOFOVERRUNS_COUNT                    ( 0xFFFFFFFFU )
#define EMAC_RXSOFOVERRUNS_COUNT_SHIFT              ( 0x00000000U )

/* RXMOFOVERRUNS */

#define EMAC_RXMOFOVERRUNS_COUNT                    ( 0xFFFFFFFFU )
#define EMAC_RXMOFOVERRUNS_COUNT_SHIFT              ( 0x00000000U )

/* RXDMAOVERRUNS */

#define EMAC_RXDMAOVERRUNS_COUNT                    ( 0xFFFFFFFFU )
#define EMAC_RXDMAOVERRUNS_COUNT_SHIFT              ( 0x00000000U )

/* MACADDRLO */

#define EMAC_MACADDRLO_VALID                        ( 0x00100000U )
#define EMAC_MACADDRLO_VALID_SHIFT                  ( 0x00000014U )
#define EMAC_MACADDRLO_MATCHFILT                    ( 0x00080000U )
#define EMAC_MACADDRLO_MATCHFILT_SHIFT              ( 0x00000013U )
#define EMAC_MACADDRLO_CHANNEL                      ( 0x00070000U )
#define EMAC_MACADDRLO_CHANNEL_SHIFT                ( 0x00000010U )
#define EMAC_MACADDRLO_MACADDR0                     ( 0x0000FF00U )
#define EMAC_MACADDRLO_MACADDR0_SHIFT               ( 0x00000008U )
#define EMAC_MACADDRLO_MACADDR1                     ( 0x000000FFU )
#define EMAC_MACADDRLO_MACADDR1_SHIFT               ( 0x00000000U )

/* MACADDRHI */

